In [74]:
import pandas as pd
import numpy as np
df=pd.read_csv('loan_data.csv')

In [75]:
df.head()

   default  amount  interest grade  years ownership   income  age
0        0    5000     10.65     B   10.0      RENT  24000.0   33
1        0    2400       NaN     C   25.0      RENT  12252.0   31
2        0   10000     13.49     C   13.0      RENT  49200.0   24
3        0    5000       NaN     A    3.0      RENT  36000.0   39
4        0    3000       NaN     E    9.0      RENT  48000.0   24

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29092 entries, 0 to 29091
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   default    29092 non-null  int64
 1   amount     29092 non-null  int64
 2   interest   26316 non-null  float64
 3   grade      29092 non-null  object
 4   years      28283 non-null  float64
 5   ownership  29092 non-null  object
 6   income     29092 non-null  float64
 7   age        29092 non-null  int64
dtypes: float64(3), int64(3), object(2)
memory usage: 1.8+ MB

In [77]:
df.describe()

,default,amount,interest,years,income,age
count,29092.000000,29092.000000,26316.000000,28283.000000,2.909200e+04,29092.000000
mean,0.110924,9593.505947,11.004567,6.145282,6.716883e+04,27.702117
std,0.314043,6323.416157,3.239012,6.677632,6.360652e+04,6.231927
min,0.000000,500.000000,5.420000,0.000000,4.000000e+03,20.000000
25%,0.000000,5000.000000,7.900000,2.000000,4.000000e+04,23.000000
50%,0.000000,8000.000000,10.990000,4.000000,5.642400e+04,26.000000
75%,0.000000,12250.000000,13.470000,8.000000,8.000000e+04,30.000000
max,1.000000,35000.000000,23.220000,62.000000,6.000000e+06,144.000000

In [78]:
df.columns

Index(['default', 'amount', 'interest', 'grade', 'years', 'ownership',
       'income', 'age'],
      dtype='object')

# Proportion of the customers have defaulted

In [90]:

default=(df[df.default==1]["default"].values.size /(df["default"].values.size))*100
default,df[df.default==1]["default"].values.size

(11.092396535129932, 3227)

# No of customers having amount > 25,000 and RENT as ownership and have defaulted (default=1)

In [80]:
amount=df.loc[(df['amount']>25000) & (df['ownership']=="RENT") & (df['default']==1)].values.size
amount

104

#  Second youngest age in the dataset

In [89]:
second_age=sorted(df['age'].unique())
print(second_age[1])

21

# No of Customers having grade as D

In [82]:
grade_D=df[df.grade=="D"].values.size
grade_D

25848

# Datapoints in "interest" column are missing

In [83]:
null_interest=df["interest"].isnull().sum()
null_interest

2776

# No of Customers having grade A, have income greater than 24000 and have OWN house and have not defaulted (default=0)

In [84]:
grade_A=df.loc[(df.grade=="A") & (df['amount']>24000) & (df['ownership']=="OWN") & (df['default']==0)].values.size
grade_A

64

# Average income of people in the age group 30-40

In [85]:
avg=np.average(df.loc[(df.age>=30) & (df.age<=40)]["income"])
avg

74623.73681081884